// 對...敵人有利
export const traitOptions =['無屬性','紅色敵人','飄浮敵人','異星戰士','黑色敵人','鋼鐵敵人',
    '天使','不死生物','古代種','惡魔'
];

// 能力選項
export const abilityOptions = [
    "攻擊力上升","死前存活","善於攻城","會心一擊",
    "終結不死","靈魂攻擊","破壞護盾","破壞惡魔盾","渾身一擊","得到很多金錢",
    "鋼鐵","小波動","波動","烈波攻擊","波動滅止",
    "超生命體特效","超獸特效",
    "攻擊力下降無效","動作停止無效","動作變慢無效","打飛敵人無效","波動傷害無效",
    "烈波傷害無效","傳送無效","古代詛咒無效","毒擊傷害無效",
];

// 效果選項 
export const effectOptions = [
    "攻擊力下降", "使動作停止", "使動作變慢", "只能攻擊", "善於攻擊", "很耐打", "超級耐打", 
    "超大傷害","極度傷害","打飛敵人","傳送","古代的詛咒","攻擊無效"
];